-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2017 年 03 月 15 日 09:13
-- 服务器版本: 5.5.24-log
-- PHP 版本: 5.4.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `message`
--

-- --------------------------------------------------------

--
-- 表的结构 `m_message`
--

CREATE TABLE IF NOT EXISTS `m_message` (
  `m_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `m_to_user` varchar(20) NOT NULL COMMENT '信息接受者',
  `m_from_user` varchar(20) NOT NULL COMMENT '发信息者',
  `m_content` varchar(500) NOT NULL COMMENT '信息内容',
  `m_state` tinyint(1) NOT NULL DEFAULT '0' COMMENT '表示阅读状态',
  `m_date` datetime NOT NULL COMMENT '发送时间',
  PRIMARY KEY (`m_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=36 ;

--
-- 转存表中的数据 `m_message`
--

INSERT INTO `m_message` (`m_id`, `m_to_user`, `m_from_user`, `m_content`, `m_state`, `m_date`) VALUES
(11, 'weng', '用户4', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:49:47'),
(12, 'weng', '用户5', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:50:18'),
(21, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:54:33'),
(22, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:54:40'),
(23, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 1, '2017-03-12 00:54:50'),
(24, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:54:56'),
(25, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:55:02'),
(26, 'weng', 'yonghu1', '生活赋予我们一种巨大的和无限高贵的礼品，这就是青春：充满着力量，充满着期待志愿，充满着求知和斗争的志向，充满着希望信心和青春。', 0, '2017-03-12 00:55:08'),
(30, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 0, '2017-03-15 14:47:37'),
(31, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 0, '2017-03-15 14:47:44'),
(32, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 1, '2017-03-15 14:47:48'),
(33, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 0, '2017-03-15 14:47:52'),
(34, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 1, '2017-03-15 14:47:57'),
(35, 'weng', 'yonghu2', '每个人开始都是一杯浑浊的水，然后会不断有人来帮你澄清。当你变得清澈的时候，别忘了那些喝了泥沙的人。', 1, '2017-03-15 14:48:03');

-- --------------------------------------------------------

--
-- 表的结构 `m_user`
--

CREATE TABLE IF NOT EXISTS `m_user` (
  `m_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT COMMENT '//用户自动编号',
  `m_uniqid` char(40) NOT NULL COMMENT '//注册唯一标识符',
  `m_active` char(40) NOT NULL COMMENT '//登录激活标识符',
  `m_username` varchar(20) NOT NULL COMMENT '//用户名',
  `m_password` char(40) NOT NULL COMMENT '//密码',
  `m_question` varchar(20) NOT NULL COMMENT '//密码问题',
  `m_answer` char(40) NOT NULL COMMENT '//密码提示答案',
  `m_email` varchar(40) DEFAULT NULL COMMENT '//邮箱',
  `m_qq` varchar(10) DEFAULT NULL COMMENT '//qq',
  `m_url` varchar(40) DEFAULT NULL COMMENT '//个人中心',
  `m_sex` char(3) NOT NULL COMMENT '//性别',
  `m_face` varchar(20) NOT NULL COMMENT '//头像',
  `m_level` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '权限，1表示管理员，默认为0表示普通会员',
  `m_regtime` datetime NOT NULL COMMENT '//注册时间',
  `m_last_logtime` datetime NOT NULL COMMENT '//最后的登录时间',
  `m_lastip` varchar(20) NOT NULL COMMENT '//最后登录的ip地址',
  PRIMARY KEY (`m_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=45 ;

--
-- 转存表中的数据 `m_user`
--

INSERT INTO `m_user` (`m_id`, `m_uniqid`, `m_active`, `m_username`, `m_password`, `m_question`, `m_answer`, `m_email`, `m_qq`, `m_url`, `m_sex`, `m_face`, `m_level`, `m_regtime`, `m_last_logtime`, `m_lastip`) VALUES
(5, 'b96eca8a9f0b065675505e4c29b0695ff9b53003', '', '用户1', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/30.jpg', 0, '2017-03-07 14:53:48', '2017-03-07 14:53:48', '::1'),
(6, '259459c7a774321471051625c0199d9e283d9c3f', '', '用户2', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/15.jpg', 0, '2017-03-07 14:54:34', '2017-03-07 14:54:34', '::1'),
(7, '47b77c6ea624a9a02df6ee7ef7e456bdec7177d1', '', '用户3', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/11.jpg', 0, '2017-03-07 14:55:08', '2017-03-07 14:55:08', '::1'),
(8, '178db9d95d1a96733fa0bdafe6a6cc33fdb2105a', '', '用户4', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/3.jpg', 0, '2017-03-07 14:55:46', '2017-03-07 14:55:46', '::1'),
(9, '07f2d6b71b9d78c591d36cd233cef754493bd004', '', '用户5', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/12.jpg', 0, '2017-03-07 15:05:38', '2017-03-07 15:05:38', '::1'),
(10, '1c98293d14627a0ba872fc314ccd9c08f5335914', '', '用户6', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/5.jpg', 0, '2017-03-07 15:06:10', '2017-03-07 15:06:10', '::1'),
(11, 'b71ce6123846ef170dbf2000b5ce017ec6d44acc', '', '用户7', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/26.jpg', 0, '2017-03-07 15:06:42', '2017-03-07 15:06:42', '::1'),
(12, '6f56d763fb55143bf1c14ac18f9a7ab6b77f704a', '', '用户8', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/11.jpg', 0, '2017-03-07 15:07:27', '2017-03-07 15:07:27', '::1'),
(13, '23fbd49478130dcfff2f93ee5a23c851a5584fa2', '', '用户9', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/32.jpg', 0, '2017-03-07 15:07:56', '2017-03-07 15:07:56', '::1'),
(14, 'e7ce03feedec7c86599983913802e3dbcfad355e', '', '用户10', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/41.jpg', 0, '2017-03-07 15:08:50', '2017-03-07 15:08:50', '::1'),
(15, 'c434b9d1881beaf9dc6816ab97bc2d7cf687f58e', '', '用户11', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/28.jpg', 0, '2017-03-07 15:09:12', '2017-03-07 15:09:12', '::1'),
(16, 'b0f274a1f203c5f3db2ae098aea44f029144dd1b', '', '用户12', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/48.jpg', 0, '2017-03-07 15:09:41', '2017-03-07 15:09:41', '::1'),
(17, '402e3519b87f8853c42ac6ecb19155cfa0407bbd', '', '用户13', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/51.jpg', 0, '2017-03-07 15:10:07', '2017-03-07 15:10:07', '::1'),
(18, 'b335a1d255f40ea57816ea52418b799f1f25b3e3', '', '用户14', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/49.jpg', 0, '2017-03-07 15:10:52', '2017-03-07 15:10:52', '::1'),
(19, '6835943a6aedcc25cea53c788de981e316764311', '', '用户15', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/33.jpg', 0, '2017-03-07 15:11:26', '2017-03-07 15:11:26', '::1'),
(20, 'ebfbc3ec6fb9e9bc96f1daa947b5c937f7556d3f', '', '用户16', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/43.jpg', 0, '2017-03-07 15:11:55', '2017-03-07 15:11:55', '::1'),
(21, 'af9b61165db40d522752194e03c1c1aee38746ce', '', 'yonghu1', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/10.jpg', 0, '2017-03-07 15:12:52', '2017-03-07 15:12:52', '::1'),
(22, '7f6194e655547ef3b580fc7f7d8afe1bd0bb719b', '', 'yonghu2', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/37.jpg', 0, '2017-03-07 15:13:24', '2017-03-07 15:13:24', '::1'),
(23, '36e5fba05aee8de38a5d16551417e8bd1001484a', '', 'yonghu3', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/40.jpg', 0, '2017-03-07 15:13:49', '2017-03-07 15:13:49', '::1'),
(24, '0beffef92298015ba3c638a0b6594765cba7e9ad', '', 'yonghu4', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/38.jpg', 0, '2017-03-07 15:14:16', '2017-03-07 15:14:16', '::1'),
(25, '99470965e5f6759c2668c8972e0963cd528b9681', '', 'yonghu5', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/47.jpg', 0, '2017-03-07 15:14:41', '2017-03-07 15:14:41', '::1'),
(26, 'a21931c1118f50132d4730622220c6de9591b45b', '', 'yonghu6', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/41.jpg', 0, '2017-03-07 15:15:09', '2017-03-07 15:15:09', '::1'),
(27, '704972e45499dfd5061e617b5918bc2964b242b6', '', 'admin1', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/50.jpg', 0, '2017-03-07 15:15:35', '2017-03-07 15:15:35', '::1'),
(28, 'd7deab1c831b79ab74f9d2c270799902e5a4fe10', '', 'admin2', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/29.jpg', 0, '2017-03-07 15:16:05', '2017-03-07 15:16:05', '::1'),
(29, '6fae8cb54777870f6c36b8a0513ee2cbf9467a8b', '', 'admin3', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '男', 'images/face/25.jpg', 0, '2017-03-07 15:16:34', '2017-03-07 15:16:34', '::1'),
(30, '7111252da64712fc298db4af68542b51ef0f2d8d', '', 'admin4', '7c4a8d09ca3762af61e59520943dc26494f8941b', '11111', '1111', 'yqwq@136.com', '46541213', 'http://www.vv.com', '女', 'images/face/30.jpg', 0, '2017-03-07 15:16:58', '2017-03-07 15:16:58', '::1'),
(31, '', '', 'user1', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(32, '', '', 'user2', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(33, '', '', 'user3', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(34, '', '', 'user4', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(35, '', '', 'user5', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(36, '', '', 'user6', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(37, '', '', 'user7', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(38, '', '', 'user8', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(39, '', '', 'user9', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(40, '', '', 'user10', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(41, '', '', 'user11', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(42, '', '', 'user12', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(43, '', '', 'user13', '123456', '1111', '1111', 'weng@163.com', '', '', '男', 'images/face/30.jpg', 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '127.0.0.1'),
(44, 'ba2290192b9fc093083e0e320b13039c97fc709e', '', 'weng', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'myhome', 'wushan', 'weng@163.com', '123456', 'http://weng.com.cn', '男', 'images/face/31.jpg', 1, '2017-03-09 14:46:27', '2017-03-09 14:46:27', '127.0.0.1');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
